GPL （GNU General Public License） ：GNU通用公共许可协议
    可自由复制
        你可以将软件复制到你的电脑，你客户的电脑，或者任何地方。复制份数没有任何限制。
    可自由分发
        在你的网站提供他人下载，拷贝到U盘送人。
    可以用来盈利
        你可以在分发软件的时候收费，但你必须在收费前向你的客户提供该软件的 GNU GPL 许可协议，以便让他们知道，他们可以从别的渠道免费得到这份软件，以及你收费的理由。
    可自由修改
        如果你想添加或删除某个功能，没问题，如果你想在别的项目中使用部分代码，也没问题，唯一的要求是，使用了这段代码的项目也必须使用GPL协议。

LGPL （GNU Lesser General Public License） ：GNU宽通用公共许可协议
    与GPL最大的区别为:它不要求其它使用LGPL授权代码的软件以LGPL方式发布
BSD (Berkeley Software Distribution)  :伯克利软件分发许可协议
MIT （Massachusetts Institute of Technology）：MIT许可协议之名源自麻省理工学院，又称“X许可协议”或“X11许可协议”
    MIT 协议可能是几大开源协议中最宽松的一个，核心条款是：
    该软件及其相关文档对所有人免费，可以任意处置，包括使用，复制，修改，合并，发表，分发，再授权，或者销售。唯一的限制是，软件中必须包含上述版 权和许可提示。
    这意味着：
        你可以自由使用，复制，修改，可以用于自己的项目。
        可以免费分发或用来盈利。
        唯一的限制是必须包含许可声明。
        MIT 协议是所有开源许可中最宽松的一个，除了必须包含许可声明外，再无任何限制
Apache （Apache License） ：Apache许可协议
    Apache 协议 2.0 和别的开源协议相比，除了为用户提供版权许可之外，还有专利许可，对于那些涉及专利内容的开发者而言，该协议最适合。
    Apache 协议还有以下需要说明的地方:
        永久权利
        一旦被授权，永久拥有。
        全球范围的权利
        在一个国家获得授权，适用于所有国家。
        授权免费，且无版税
        前期，后期均无任何费用。
        授权无排他性
        任何人都可以获得授权
        授权不可撤消
        一旦获得授权，没有任何人可以取消。比如，你基于该产品代码开发了衍生产品，你不用担心会在某一天被禁止使用该代码。
    分发代码方面包含一些要求，主要是，要在声明中对参与开发的人给予认可并包含一份许可协议原文
MPL （Mozilla Public License） ：Mozilla公共许可协议    
    MPL既是得到自由软件基金会承认的自由软件许可证，也是得到开放源代码促进会承认的开源软件许可证。MPL允许在其授权下的源代码与其他授权的文件进行混合，包括私有许可证。
    但在MPL授权下的代码文件必须保持MPL授权，并且保持开源。这样的条款让MPL既不像MIT和BSD那样允许派生作品完全转化为私有，也不像GPL那样要求所有的派生作品，包括新的组件在内，全部必须保持GPL。
    通过允许在派生项目中存在私有模块，同时保证核心文件的开源，MPL同时激励了商业及开源社区来参与帮助开发核心软件。
    使用MPL授权的软件并不受专利的限制，其可以自由使用，修改，并可自由的重新发布。
    带有专利代码的版本仍然可以使用，转让，甚至出售，但未经许可则不能修改代码。此外，MPL并不授予用户对于开发者商标的使用权。
    为了满足MPL的条款限制，用户必须负担一些“责任”，主要是关于散发使用MPL授权的软件。
    用户必须确保重新散发的软件所有源代码均以MPL授权，即使是以可执行文件的方式提供或是与其他使用专有软件授权的源代码结合也一样。
    但若跟以GNU通用公共许可协议、GNU宽通用公共许可证、Affero通用公共许可证授权的源代码结合则是例外。此时开发者则可选用以上三种更加严格的条款来授权。